Revit 2027 API
ElectricalLoadClassification Properties
The ElectricalLoadClassification type exposes the following members.
Properties
Name | Description
Abbreviation |  The abbreviation of the load classification name
ActualElectricalLoadLabel |  The name template for the actual load parameter on the load classification.
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemandFactorId |  The demand factor definition this load classification element uses.
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
Document | Returns the Document in which the Element resides.
(Inherited from Element)
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
LoadSummaryDemandFactorLabel |  The name template for the demand factor parameter of the load classification.
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Motor |  Indicates if this load classification is to be used for motors.
Name | A human readable name for the Element.
(Inherited from Element)
Other |  Indicates if it is the default load classification, and its name is Other.
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
PanelConnectedCurrentLabel |  The name template for the connected current parameter on the load classification.
PanelConnectedLabel |  The name template for the connected load parameter of the load classification.
PanelEstimatedCurrentLabel |  The name template for the estimated current parameter on the load classification.
PanelEstimatedLabel |  The name template for the estimated demand parameter on the load classification.
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
SpaceLoadClass |  The electrical load class associated with a space.
Spare |  Indicates if this load classification is to be used for spare.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace